import React from "react";
import "@/components/terms/terms.css";
import Link from "next/link";

function Terms() {
  return (
    <div className="terms">
      <div className="container">
        <div className="right">
          <Link href={"/"}>قوانین و شرایط استفاده پی‌جیب</Link>
          <Link href={"/"}>فرایند احراز هویت</Link>
          <Link href={"/"}>قوانین مربوط به تراکنش ها</Link>
        </div>
        <div className="left">
          <div className="general-rules">
            <h2>قوانین و شرایط استفاده از بستر پی‌جیب</h2>
            <p>
              1. کاربر موظف است با آگاهی از شرایط و قوانین پی جیب اقدام به ثبت
              سفارش و استفاده از خدمات پی جیب کند. برای جلوگیری از هرگونه سوء
              تفاهم و بروز مشکلات احتمالی، ضروری است کاربر قبل از ثبت درخواست،
              قوانین را به دقت مطالعه و تأیید کند. استفاده از خدمات پی جیب در هر
              سطحی به منزله مطالعه و پذیرش این سند می‌باشد و رابطه قراردادی
              ایجاد شده مابین پی جیب و کاربران آن در چارچوب قوانین کشور و مستند
              به مواد ۱۰ و ۲۱۹ قانون مدنی ایران تنظیم می‌گردد.
            </p>
            <p>
              2. این حق برای پی جیب محفوظ است که در هر زمان مفاد این سند را
              تغییر دهد. هر تغییری در آینده در همین صفحه منتشر و به‌روزرسانی
              خواهد شد و کاربر توافق می‏‌کند که ادامه استفاده او از بستر برخط پی
              جیب به معنی پذیرش هرگونه تغییرات این متن است.
            </p>
            <p>
              3. احراز هویت بخش مهمی از ارائه‌ی خدمات در پی جیب می‌باشد. پی جیب
              همواره در تلاش است تا هویت کاربران را از هر جهت سنجیده و احراز
              کند. احراز هویت از پرداخت‌های ناخواسته و نامتعارف جلوگیری می‌کند.
              استفاده‌ی کاربر از خدمات پی جیب به این معنی است که از قوانین احراز
              هویت آگاهی داشته و پذیرفته است. احراز هویت با کارت ملی، پاسپورت و
              یا شناسنامه جدید دارای شماره ملی ایرانی انجام می شود.
            </p>
            <p>
              4. احراز هویت برای استفاده از خدمات پی جیب ضروری بوده و کاربران
              موظفند اطلاعات صحیح خود را بارگذاری نمایند. بدیهی است در صورت وجود
              هرگونه اشتباه در ثبت اطلاعات، مسئولیت به عهده‌ی کاربر بوده و پی
              جیب حق توقف ارائه خدمات به کاربر مزبور و محدود کردن دسترسی کاربر
              را خواهد داشت. پی جیب خود را ملزم به حفظ اطلاعات شخصی کاربران خود
              می‌داند.
            </p>
          </div>
          <div className="authentication-process">
            <h2>فرایند احراز هویت در پی جیب</h2>
            <p>
              5. به منظور پیروی از قوانین مبارزه با پول‌شویی، نیاز است تمام
              کاربران نسبت به تأیید هویت خود اقدام کنند. تایید هویت در سه مرحله
              با ارائه مدارک مربوطه صورت می‌گیرد.
            </p>
            <div>
              <p>
                a. تأیید ایمیل: پس از ثبت‌نام در پی جیب، یک لینک تأیید به آدرس
                ایمیل ثبت‌نامی شما ارسال می‌گردد. با تأیید این لینک، مرحله اول
                احراز هویت انجام خواهد شد.
              </p>
              <p>
                b. تایید شماره تلفن همراه: با وارد نمودن شماره تلفن همراه، یک کد
                تأیید به آن ارسال خواهد شد، با وارد نمودن کد در پلتفرم پی جیب
                شماره همراه شما مورد تأیید قرار خواهد گرفت. در وارد نمودن شماره
                همراه خود دقت نمایید زیرا مهمترین راه‌های ارتباطی ما با شما در
                پروسه پشتیبانی همین شماره خواهد بود. شماره همراه ثبت شده باید در
                یکی از پیامرسان های واتساپ و یا تلگرام فعال باشد و کاربر پاسخگو
                باشد.
              </p>
              <p>
                c. تایید کارت شناسایی: در این مرحله با گرفتن سلفی به صورتی که
                کارت ملی ایرانی و یا پاسپورتتان را در کنار چهره خود قرار دهید
                سپس تصویر آپلود شده ی شما توسط پی جیب بررسی و در صورت نبود مشکل،
                تأیید خواهد شد و فرایند احراز هویت شما تکمیل خواهد شد.
              </p>
            </div>
            <p>
              6. بدیهی است پی جیب این حق را برای خود محفوظ می‌دارد که در زمان
              ایجاد حساب کاربری، بررسی احراز هویت و یا در طول استفاده از خدمات
              توسط کاربران، بنا بر لزوم انطباق با قوانین و دستورالعمل‌های صادره
              و یا به منظور حصول اطمینان از صحت و تطبیق اطلاعات و مدارک دریافتی،
              اطلاعات و مستندات بیشتری را مطالبه نماید.
            </p>
            <p>
              7. پی‌جیب به حریم خصوصی کاربران خود احترام می‌گذارد و خود را متعهد
              به حفاظت از داده‌های شخصی آن‌ها می‌داند. باتوجه به اینکه جمع‌آوری
              و پردازش داده شخصی بخشی ضروری در ارائه خدمات مبتنی بر فناوری
              اطلاعات است، پی‌جیب با دریافت رضایت کاربران، رعایت قوانین و مقررات
              کشور و آگاهی از اهمیت حفاظت از داده‌های شخصی، نسبت به جمع‌آوری و
              پردازش داده‌های شخصی اقدام می‌کند. داده‌هایی که به تنهایی یا در
              ترکیب با داده‌های دیگر، معرف یک شخص حقیقی زنده بوده یا به شناسایی
              یک شخص حقیقی زنده منجر گردد، به عنوان داده‌ شخصی شناخته می‌شود. با
              استفاده از بستر پی‌جیب، کاربر به صراحت و با آگاهی کامل رضایت خود
              را برای انجام اقدامات ذیل نسبت به داده‌(های) شخصی متعلق به وی که
              در طول فرآیند ثبت‌نام و ایجاد حساب کاربری و در بازه زمانی استفاده
              از پلتفرم پی‌جیب در اختیار پی‌جیب قرار می‌دهد اعلام می‌دارد:
              جمع‌آوری، ذخیره، استفاده، توزیع، تجزیه‌وتحلیل، ترکیب با داده‌های
              دیگر، انتقال یا هر نوع عملیات دیگر مطابق با الزامات و قوانین
              مقررات کشور در خصوص استفاده از داده شخصی.
            </p>
            <p>
              پی‌جیب ممکن است از کوکی‌ها (cookies) در جمع‌آوری اطلاعات
              بازدیدکنندگان پلتفرم پی‌جیب استفاده کند. کوکی فایلی است که به
              درخواست یک سایت، توسط مرورگر ایجاد می‌شود و به سایت امکان ذخیره
              بازدید‌های شما و مناسب‌سازی آن‌ها را فراهم می‌دهد.
            </p>
            <p>
              9. اطلاعاتی که کاربر در طول فرآیند ثبت‌نام و ایجاد حساب کاربری و
              در بازه زمانی استفاده از پلتفرم پی‌جیب (مانند ثبت سفارش) در بستر
              پی‌جیب وارد کرده است، کاملاً محفوظ خواهد ماند و به هیچ شخص یا
              سازمان دیگری ارائه نخواهد شد؛ به استثنای موارد مربوط به مطابقت
              عملکرد پی‌جیب با قوانین و الزامات کشور و یا دستور مقامات و مراجع
              صالح و ذیربط.
            </p>
          </div>
          <div className="rules-transactions">
            <h2>
              قوانین مربوط به تراکنش های پی‌جیب
            </h2>
            <p>
              10. کاربران موظفند تمامی مفاد این سند و تعهدات مندرج در آن را
              مطالعه نموده و صرفا در صورت پذیرش آن اقدام به ثبت نام و انجام
              تراکنش نمایند. ثبت نام کاربران و انجام تراکنش در سایت پی جیب به
              منزله تأیید قوانین پی جیب است.
            </p>
            <p>
              11. جهت ایجاد حساب کاربری در پی جیب داشتن حداقل سن ۱۸ سال تمام
              خورشیدی الزامی است. در صورتی که کاربر به عنوان ولی خاص و یا قیم
              قانونی اقدام به ایجاد حساب کاربری برای فرد تحت سرپرستی و نظارت خود
              می‌کند، باید این امر را به اطلاع پی جیب برساند و مدارک مورد
              درخواست پی جیب را فراهم آورد، در غیر این صورت پی جیب به محض اطلاع
              قادر به تعلیق، محدودیت و یا بستن حساب کاربری خواهد بود و کاربر حق
              هیچ‌گونه اعتراضی در این خصوص نخواهد داشت.
            </p>
            <p>
              12. از زمان شروع تراکنش، تغییرات نرخ ارز تاثیری در ادامه فرایند
              تراکنش نخواهد داشت و کاربران متعهد می‌شوند با نرخ ارز توافق شده
              تراکنش را به پایان برسانند. در صورت عدم انجام تعهدات توسط هر یک از
              کاربران، پی جیب مجاز است در صورت تشخیص، دسترسی کاربر مورد نظر را
              محدود، معلق و یا ممنوع کند.
            </p>
            <p>
              13. پس از تایید مرحله تأیید طرفین توسط هر دو کاربر (دریافت کننده
              ارز و پرداخت کننده ارز)، تراکنش شروع شده و به هیچ عنوان امکان
              انصراف از تراکنش وجود نخواهد داشت و در صورت عدم انجام تعهد هر کدام
              از کاربران، دسترسی کاربر به حساب کاربری از وی سلب می‌شود. ضروری
              است کاربران قبل از مرحله تایید طرفین، تمام موارد مربوط به انجام
              تراکنش از جمله داشتن موجودی ریالی و ارزی، دسترسی به حساب، نرخ
              معامله، حجم معامله، مسدود نبودن حساب و سایر موارد را بررسی و از
              موارد فوق الذکر اطمینان حاصل کنند. بدیهی است کلیک بر روی دکمه شروع
              تراکنش به معنای تایید معامله بین طرفین است.
            </p>
            <p>
              14. در صورت پیش نبردن تراکنش توسط کاربر و عدم پاسخگویی به تیم
              پشتیبانی، تیم پی جیب مجاز است دسترسی کاربر مورد نظر را محدود، معلق
              و یا ممنوع کند و امکان دریافت خدمات به کاربر را از وی سلب نماید.
            </p>
            <p>
              15. پی جیب مجاز است در صورتی که درخواست ثبت شده‌ی کاربر، دارای
              پیشنهادهای منقضی شده و تعیین وضعیت نشده باشد و کاربر پاسخگوی تیم
              پشتیبانی پی جیب نباشد، نسبت به حذف درخواست ثبت شده توسط کاربر
              اقدام نماید.
            </p>
            <p>
              16. پی جیب می تواند در صورتی که تشخیص دهد نرخ ارز ثبت شده در
              درخواست توسط کاربر نرخی غیرمتناسب با نرخ روز بازار آزاد ارز است،
              به تشخیص خود اقدام به حذف درخواست نماید.
            </p>
            <p>
              17. پی جیب مجاز است اگر کاربری در قسمت توضیحات، یادداشتی بر خلاف
              قوانین و روال کاری پی جیب ثبت کرده باشد در صورت تشخیص اقدام به حذف
              توضیحات درخواست کند.
            </p>
            <p>
              18. پی جیب هیچ گونه مسئولیتی در قبال سهل انگاری کاربر در انتخاب
              نوع انتقال ارز (بین بانکی، رولوت، پی پال و سایر موارد) ندارد و
              مسئولیت این موضوع منحصرا بر عهده کاربر است. ضروری است کاربران در
              انتخاب نوع انتقال ارز دقت کامل مبذول دارند.
            </p>
            <p>
              19. کاربران موظفند در زمان ثبت پیشنهاد بر روی درخواست های موجود در
              پلتفرم پی جیب، به توضیحات نگارش شده‌ی درخواست دقت کنند و صرفا در
              صورت موافقت با توضیحات اقدام به ثبت پیشنهاد کنند.
            </p>
            <p>
              20. پروسه تراکنش های بانکی در بانک های خارج از ایران، حدودا بین 1
              تا 3 روز کاری ممکن است زمان ببرد و کسر وجه از حساب فروشنده لزوما
              به منزله دریافت مبلغ توسط خریدار نیست. پی جیب ملزم به پیگیری از
              سمت خریدار مبنی بر تأیید دریافت مبلغ ارزی است. در صورتی که در این
              بازه زمانی خریدار هم چنان مدعی باشد که مبلغ ارزی را در حساب خود
              دریافت نکرده است، طرفین تبادل (دریافت کننده ارز و پرداخت کننده
              ارز) ملزم به ارسال تصویر از گردش حسابشان از تاریخ شروع تراکنش تا
              زمان انجام بررسی توسط پی جیب هستند و هر دوی کاربران هم چنین موظف
              به پیگیری (از طریق ارسال ایمیل، تماس تلفنی و یا مراجعه حضوری به
              شعبه بانکی خود) از سمت بانک خودشان هستند. در صورت عدم همکاری هر یک
              از کاربران، پی جیب مجاز است با تشخیص خود در مورد تراکنش تصمیم گیری
              کند.
            </p>
            <p>
              21. کاربر موظف است تصویری واضح و خوانا از رسیدهای پرداختی‌ خود،
              برای پشتیبان پی جیب ارسال یا در سایت بارگذاری کند.
            </p>
            <p>
              22. کاربر در قسمت انتخاب کشور حساب مبداء و مقصد، باید کشوری را
              انتخاب کند که حساب بانکی متعلق به آن کشور باشد. مسئولیت هرگونه عدم
              تطبیق در انتخاب کشور حساب بانکی بر عهده ی کاربر مورد نظر است و پی
              جیب مجاز است در صورت لزوم اقدام به لغو تراکنش کند.
            </p>
            <p>
              23. ارتباط تیم پشتیبانی پی جیب با کاربر جهت سهولت در انجام تراکنش
              های ارزی کاربران است و در نتیجه، پاسخگویی کاربر ضروری می باشد.
            </p>
            <p>
              24. تسویه ریالی با پرداخت کننده ارز، با توجه به سیکل های تسویه
              شاپرک با پی جیب می باشد در نتیجه 24 ساعت پس از دریافت وجه ریالی از
              دریافت کننده ارز، پلتفرم پی جیب امکان تسویه ریالی با پرداخت کننده
              ارز را دارد.
            </p>
            <p>
              25. پرداخت کنندگان ارز ملزم به نگارش عبارت Family and Friends در
              قسمت رفرنس رسید واریزی ارزی شان هستند و در صورت عدم نگارش و ایجاد
              مشکل احتمالی چه برای دریافت کننده ارز و چه پرداخت کننده ارز،
              مسئولیت این موضوع بر عهده‌‌ی فروشنده‌ی تراکنش می باشد. بدیهی است
              موضوع مذکور در این بند صرفا جنبه مصداقی داشته و پرداخت کنندگان ارز
              در هر حال می‌بایست سایر موارد و جنبه‌های احتیاطی لازم به منظور کسب
              اطمینان از انجام موفقیت آمیز تراکنش بانکی را همواره لحاظ نمایند و
              در غیر این صورت، مسئولیت عواقب آن بر عهده‌‌ی پرداخت کننده ارز
              تراکنش می باشد.
              <br />
              نکته: انتقال فقط و فقط از حساب های شخصی در خارج از کشور می باشد و
              حساب های بیزنسی و شرکتی مورد تأیید نمی باشد.
            </p>
            <p>
              26. در موارد استثناء، در صورتی که نیاز به دریافت اطلاعات از دریافت
              کننده ارز و یا پرداخت کننده ارز بنا به درخواست بانک یکی از طرفین
              باشد، کاربران (دریافت کننده ارز و پرداخت کننده ارز) موظفند با تیم
              پی جیب همکاری کامل نمایند.
            </p>
            <p>
              27. مسئولیت ثبت صحیح شماره حساب و شماره کارت ایرانی و ثبت شماره
              صحیح IBAN و BIC Code، به عهده‌ی کاربر خواهد بود. در صورت بروز
              هرگونه مشکل اعم از اشتباه در ثبت آدرس صحیح، نقص حساب و بلوکه شدن
              دارایی‌های کاربران، هیچ گونه مسئولیتی به عهده ی پی جیب نخواهد بود.
            </p>
            <p>
              28. در صورت عدم انجام تعهد توسط پرداخت کننده ارز و عدم پرداخت ارزی
              توسط وی پی جیب حق دارد مستقلاً آن تراکنش را ابطال و دارایی طرف
              خریدار را به حساب وی عودت دهد و کاربر حق هرگونه اعتراض و ادعایی را
              در خصوص نحوه عملکرد پی جیب از هر جهت از خود ساقط می‌نماید
            </p>
            <p>
              29. تیم پشتیبانی پی جیب تعهد دارد از ابتدای شروع تا پایان تراکنش،
              پیگیری های لازم را انجام دهد و پاسخگوی کاربران باشد و سعی معقول
              خود را برای انجام تراکنش در سریعترین زمان ممکن به کار گیرد و در
              این مسیر نیازمند صبوری و همراهی کاربران خود می‌باشد.
            </p>
            <p>
              30. کاربر متعهد می‌گردد که در صورت بروز یا ایجاد هرگونه تغییر در
              اطلاعات خود پس از ثبت‌نام در سایت پی جیب، در اسرع وقت اطلاعات جدید
              را در قسمت مربوط به اطلاعات حساب کاربری خود به روزرسانی نماید. در
              هر صورت، پی جیب هیچ گونه مسئولیتی در خصوص مشکلات، هزینه‌ها و یا
              خساراتی که به علت عدم به روزرسانی اطلاعات به وجود می آید، نخواهد
              داشت.
            </p>
            <p>
              31. در مواردی که کاربر برای دریافت خدمات، وجه ریالی به پی جیب
              پرداخت کند اما خدمات را دریافت نکند؛ وجه پرداختی کاربر به صورت
              ریال و امانت نزد پی جیب می ماند. این مبلغ یا به حسابی که پرداخت
              ریالی از طریق آن انجام شده برگشت داده میشود و یا به صورت شارژ حساب
              کاربر نزد پی جیب می ماند و برای تراکنش های بعدی کاربر از مبلغ
              پرداختی شان کسر خواهد شد. تغییرات نرخ ارز به هیچ وجه تاثیری در
              مقدار وجهی که به کاربر بازپرداخت می‌شود، نخواهد داشت.
            </p>
            <p>
              32. وجهی که از سوی کاربر در سیستم پی جیب پرداخت می‌شود در راستای
              توافق طرفین به صورت امانت نزد پی جیب است و با این وجه هیچ گونه
              کاری انجام نمی‌شود و مشمول هیچ سودی نمی‌شود.
            </p>
            <p>
              33. کاربر نمی‌تواند در پلتفرم پی جیب با کارت بانکی که به نام شخص
              دیگری باشد، خدمات دریافت نماید. واریز و دریافت وجه ریالی فقط به
              حساب های متعلق به کاربر احراز هویت شده امکان پذیر است.
            </p>
            <p>
              34. در صورت نیاز به عودت وجه به کاربر فقط به کارت بانکی که با آن
              پرداخت انجام شده، عودت داده می‌شود.
            </p>
            <p>
              35. هر کاربر فقط برای خود می‌تواند حساب کاربری ایجاد کند. ایجاد
              حساب کاربری برای شخص دیگری امکان‌پذیر نمی‌باشد. تمامی تبادلات
              انجام گرفته توسط کاربر با حساب کاربری او از نظر پی‌جیب صحیح تلقی
              می‌گردد و فرض پی‌جیب بر این است که کاربر حقیقی دستور این تبادلات
              را صادر کرده است. در صورتی که کاربر معتقد است تراکنشی در حساب
              کاربری او انجام گرفته است که توسط او نبوده باید در سریع‌ترین زمان
              ممکن این موضوع را به اطلاع پی‌جیب برساند تا اقدامات و هماهنگی‌های
              لازم اتخاذ گردد.
            </p>
            <p>
              36. کاربران پی جیب تعهد می دهند که از خدمات پلتفرم پی جیب تنها
              برای خود استفاده نموده و مسئولیت استفاده از خدمات پی‌جیب برای فردی
              که فرآیند احراز هویت را طی نکرده باشد به عهده کاربر خواهد بود.
              شماره حساب اعلام شده به سایت می بایست متعلق به کاربر بوده و
              کاربران مجاز به دادن حساب بانکی متعلق به اشخاص دیگر نیستند.
            </p>
            <p>
              37. کاربر بایستی تمامی اقدامات لازم جهت حفظ ایمنی و امنیت رایانه و
              سایر دستگاه‌های الکترونیک خود را به منظور جلوگیری از مفقودشدن،
              دزدی، دسترسی غیرمجاز و هرگونه سوءاستفاده دیگر انجام دهد. پی‌جیب
              هیچ گونه مسئولیتی در قبال آسیب یا تاثیر ناشی از هرگونه بدافزار
              رایانه‌ای، ویروس، تروجان، کرم رایانه‌ای، باج‌افزار، جاسوس‌افزار،
              بات و موارد مشابه یا سایر کدهای مخربی که ممکن است بر رایانه یا
              سایر تجهیزات کاربر تأثیر بگذارد، یا هرگونه فیشینگ، جعل یا سایر
              حملات یا دسترسی‌های غیرمجاز برعهده نمی‌گیرد. همچنین سرویس‌های
              پیامک و ایمیل در برابر حملات جعل و فیشینگ آسیب‌پذیر هستند و کاربر
              باید در ارزیابی پیام‌هایی که ادعا می‌شود به هر شکلی مرتبط با
              پی‌جیب هستند یا توسط پی‌جیب ارسال شده‌اند، دقت نموده و از تطبیق و
              صحت کامل اطلاعات اطمینان حاصل نماید.
            </p>
            <p>
              38. چنانچه پی جیب متوجه تراکنش مالی مشکوک از طریق حساب بانکی کاربر
              شود، دسترسی کاربر به پلتفرم پی جیب مسدود می‌گردد و تا رفع مشکل وجه
              در نزد پی جیب بدون تعلق هرگونه سود و خسارت باقی می‌ماند.
            </p>
            <p>
              39. پی جیب به عنوان پلتفرم خدمات مالی، هیچ گونه مسئولیتی در قبال
              نرخ توافقی کاربران و سود و زیان حاصل از آن ندارد.
            </p>
            <p>
              40. پی جیب این اطمینان را می‌دهد که دارایی‌های کاربران را نزد خود
              به امانت و به بهترین شکل و با بالاترین استانداردهای امنیتی ممکن،
              حفظ نماید. در صورت بروز هرگونه مشکل امنیتی، پی جیب متعهد به جبران
              خسارت خواهد بود.
            </p>
            <p>
              41. زمان تسویه معادل ریالی به حساب کاربران بر اساس سیکل های انتقال
              بانکی پایا و ساتنا متفاوت می باشد.
            </p>
            <p>
              42. کاربر می‌پذیرد که به جز در موارد مورد تعهد پی جیب، حق هیچ گونه
              داعیه، طلب و شکایت از پلتفرم پی جیب (شرکت رامان سامانه پارس)،
              مدیران، کارمندان و یا افراد مرتبط با این پلتفرم را نخواهد داشت.
              همچنین، کاربر تأیید می‌نماید که در صورت بروز هرگونه مسئولیت حقوقی
              و قضائی برای پی‌جیب که منشا آن سوءاستفاده، تقصیر و یا نقض مقررات
              قانونی یا قراردادی کاربر باشد، کاربر متعهد به پاسخگویی، جبران
              خسارت، پرداخت هزینه ها و به طور کلی غرامت از پی‌جیب و مدیران و
              کارمندان آن خواهد بود.
            </p>
            <p>
              43. کارمزد تراکنش‌های مالی انجام شده در پی جیب مطابق با توضیحات
              ارائه شده در صفحه کارمزدها در صفحه اول سایت می‌باشد و مورد تأیید
              کاربر می باشد.
            </p>
            <p>
              44. کاربر متعهد است که از فعالیت‌های خود در پی‌جیب برای مقاصد و
              فعالیت‌های خلاف قوانین و مقررات کشوری و بین‌المللی، مفاد مندرج در
              این سند، اختفاء موضوع جرم، جرایمی شامل و نه محدود به کلاهبرداری،
              پول‌شویی، شرط‌بندی، قاچاق ارز و کالا، جرائم اقتصادی، ‌جرم تامین
              مالی تروریسم و سایر موارد استفاده نکند. در غیر این صورت، کلیه
              عواقب آن برعهده وی بوده و مسئولیت پاسخگویی، جبران خسارت، پرداخت
              هزینه ها و به طور کلی غرامت از پی‌جیب و مدیران و کارمندان آن
              برعهده کاربر متخلف خواهد بود.
            </p>
            <p>
              44. کاربر متعهد است که از فعالیت‌های خود در پی‌جیب برای مقاصد و
              فعالیت‌های خلاف قوانین و مقررات کشوری و بین‌المللی، مفاد مندرج در
              این سند، اختفاء موضوع جرم، جرایمی شامل و نه محدود به کلاهبرداری،
              پول‌شویی، شرط‌بندی، قاچاق ارز و کالا، جرائم اقتصادی، ‌جرم تامین
              مالی تروریسم و سایر موارد استفاده نکند. در غیر این صورت، کلیه
              عواقب آن برعهده وی بوده و مسئولیت پاسخگویی، جبران خسارت، پرداخت
              هزینه ها و به طور کلی غرامت از پی‌جیب و مدیران و کارمندان آن
              برعهده کاربر متخلف خواهد بود.
            </p>
            <div>
              <p>
                a) الف. درخواست هر یک از مقامات، مراجع و یا ارگان‌های دارای
                صلاحیت از قبیل محاکم قضایی و پلیس فتا.
              </p>
              <p>
                b) ب. بالا بودن مبلغ تراکنش و یا عدم همخوانی فاحش تراکنش با
                تاریخچه حساب کاربری به صورتی که تراکنش از نظر پی‌جیب مشکوک و
                نیازمند بررسی و ارایه مدارک و مستندات بیشتر تلقی شود.
              </p>
              <p>
                c) ج. فرضی که کاربر مرتکب جرم شده یا مظنون به تملک عواید از محل
                ارتکاب جرم باشد.
              </p>
            </div>
            <p>
              46. هرگونه عواقب و پیامدهای مالیاتی ناشی از تراکنش‌های کاربران
              منحصرا برعهده خود آنان بوده و پی‌جیب هیچ‌گونه مسئولیتی در این خصوص
              نخواهد داشت.
            </p>
            <p>
              47. کلیه ابعاد و مصادیق حقوق مالکیت فکری، علائم تجاری، طرح‌های
              گرافیکی، رابط کاربری، رابط بصری، عکس، لوگو، کدهای نرم‌افزار و
              ساختار و نحوه بیان و تنظیم مطالب و محتوای موجود در بستر پی‌جیب و
              به طور کلی سایر حقوق و امتیازات مربوطه منحصراً در مالکیت پی جیب
              است و هیچ شخصی حق استفاده کلی و یا جزئی از آن‌ها را بدون رضایت
              صریح و قبلی پی‌جیب نخواهد داشت.
            </p>
            <p>
              48. در صورت بروز هرگونه اختلاف میان کاربر و پی جیب، دوطرف تمام
              تلاش خود را برای حل موضوع اختلاف از طریق مذاکره به کار خواهند بست.
              در این راستا کاربر متعهد به همکاری با پی‌جیب و ارائه اطلاعات لازم
              و در صورت لزوم شرکت در جلسات حضوری یا برخط خواهد بود. در صورت عدم
              حصول توافق ظرف ۳۰ روز از تاریخ اعلام کتبی قصد حل اختلاف از طریق
              مذاکره، کلیه اختلافات و دعاوی ناشی از این سند و یا راجع به آن از
              جمله انعقاد، اعتبار، فسخ، نقض، تفسیر یا اجرای آن به مرکز داوری
              اتاق بازرگانی، صنایع، معادن و کشاورزی ایران ارجاع می‌گردد تا مطابق
              با قانون اساسنامه و آیین داوری آن مرکز به صورت قطعی و لازم‌الاجرا
              به‌وسیله داور منفرد حل و فصل شود. داور علاوه بر مقررات حاکم، عرف
              تجاری ذی‌ربط را نیز مراعات خواهد نمود. شرط داوری حاضر،
              موافقت‌نامه‌ای مستقل از مفاد سند حاضر تلقی می‌شود و در هر حال
              لازم‌الاجرا است.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Terms;
