import React from "react";
import "@/components/about/about.css";

function About() {
  return (
    <div className="about" id="about">
      <div className="container">
        <div className="title">
          <p>درباره‌ی ما</p>
        </div>
        <div className="description">
          <p>
            پلتفرم پی‌جیب یک بستر امن برای تبادل بین‌المللی ارز به صورت فرد به
            فرد و بدون واسطه است. مجموعه‌ی پی‌جیب با درک نیاز هموطنان عزیز مقیم
            خارج از ایران و خانواده‌ها، دوستان و آشنایان آن‌ها در ایران و در
            نبود سیستمی امن و قابل اعتماد جهت تبادل ارز، در سال ۱۳۹۸ شکل گرفته
            است.
          </p>
          <p>
            عملکرد این سیستم با هدف بهبود فرایند‌های تبادل ارز مرسومی طراحی شده
            که در قالب گروه‌های تلگرام، واتساپ و یا به صورت حضوری، فرایند تبادل
            ارز را انجام می‌دهند. اصلی‌ترین پیچیدگی در این روش‌ها عدم شناخت
            متقابل بین دریافت‌کننده‌ی ارز و دریافت‌کننده‌ی ریال است و با شناسایی
            این مسئله، پی‌‌جیب به عنوان شخص معتمد دو طرف عمل کرده و کاربران را
            از شناسایی طرف مقابل و حل چالش اعتماد بی‌نیاز می‌کند. یکی دیگر از
            پیچیدگی‌های روش‌های مرسوم، مشخص نبودن روند تبادل ارز است که
            محدودیت‌های بانکی بین‌المللی موجب آن می‌شود و پی‌‌جیب برای حل این
            مسئله نیز مدل تراکنش مرحله‌ای و شفافی را ارائه داده است. بنابراین
            می‌توان گفت مهم‌ترین مزیتی که این پلتفرم نسبت به شیوه‌های پیشین
            دارد، امنیت و شفافیت در انتقال پول است. در پی‌جیب نرخ ارز با توافق
            طرفین نهایی شده و تراکنش آغاز می‌گردد. در ادامه و طی هفت مرحله که به
            صورت شفاف طرفین را در جریان فرایند تراکنش قرار می‌دهد، یک تراکنش به
            انجام می‌رسد. طی کردن هر مرحله از تراکنش مستلزم تأیید طرفین بوده و
            هر تراکنش با مشارکت طرفین و مدیریت پی‌جیب به صورت شفاف و امن، به
            صورت کامل انجام خواهد شد.
          </p>
          <p>
            فعالیت پی‌جیب برای تراکنش‌های خرد و نیازهای غیرتجاری ایرانیان داخل و
            خارج کشور طراحی شده و مأموریت اصلی پی‌جیب، کاهش دغدغه و نگرانی
            انتقال پول جهت استفاده‌های غیرتجاری نظیر تسهیل پرداخت هزینه‌های
            مربوطه برای دانشجویان، دریافت دستمزد حاصل از پروژه‌های خارج از کشور
            در ایران، خرید خرد کالا و خدمات از سایر کشورها و همین‌طور تسهیل
            فرایند پرداخت در داخل کشور برای ایرانیان خارج کشور می‌باشد.
          </p>
        </div>
      </div>
    </div>
  );
}

export default About;
